app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.get_all_ratings()
    @all_checked_boxes = params[:ratings]
    sortOption = params[:sortOption]
    @here = 'there'

    if session[:sortOption]
      if !sortOption
        sortOption = session[:sortOption]
      end
    end

    if !@all_checked_boxes
      @all_checked_boxes = session[:ratings]
    end

    if(@all_checked_boxes)
      session[:ratings] = @all_checked_boxes
      keys = @all_checked_boxes.keys

      @all_ratings.each_with_index{ |item, index|
        if !@all_checked_boxes.include?(item[0])
          value = item[1] =false
        end
      }
    end

    if keys
      if keys.size != 0
        allMovies = Movie.find_all_by_rating(keys)
      else
        allMovies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')
SELECT "movies".* FROM "movies"